name: "CNN-test"
layers {
  name: "mit2"
  type: DATA
  top: "data"
  top: "label"
  data_param {
    source: "mit2-test-leveldb"
    batch_size: 100
  }
}
layers {
  name: "conv"
  type: CONVOLUTION
  bottom: "data"
  top: "conv"
  blobs_lr: 1
  blobs_lr: 2
  convolution_param {
    num_output: 10
    kernel_size: 5
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "pool"
  type: POOLING
  bottom: "conv"
  top: "pool"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layers {
  name: "ip"
  type: INNER_PRODUCT
  bottom: "pool"
  top: "ip"
  blobs_lr: 1
  blobs_lr: 2
  inner_product_param {
    num_output: 4
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layers {
  name: "prob"
  type: SOFTMAX
  bottom: "ip"
  top: "prob"
}
layers {
  name: "accuracy"
  type: ACCURACY
  bottom: "prob"
  bottom: "label"
  top: "accuracy"
} 